# GroupBy

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['Google','Deloitte','Accenture','Google','Deloitte'],
       'Person':['Sam','Nabh','Mary','Lynn','Merebeth'],
       'Sales':[200,100,300,400,500]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     Company    Person  Sales
0     Google       Sam    200
1   Deloitte      Nabh    100
2  Accenture      Mary    300
3     Google      Lynn    400
4   Deloitte  Merebeth    500

In [5]:
df.groupby('Company')

In [6]:
companyGroup = df.groupby('Company')

In [8]:
companyGroup.mean()

           Sales
Company
Accenture    300
Deloitte     300
Google       300

In [9]:
companyGroup.sum()

           Sales
Company
Accenture    300
Deloitte     600
Google       600

In [10]:
companyGroup.sum().loc['Google']

Sales    600
Name: Google, dtype: int64

In [11]:
df.groupby('Company').sum().loc['Accenture']

Sales    300
Name: Accenture, dtype: int64

In [12]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
Accenture   1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0
Deloitte    2.0  300.0  282.842712  100.0  200.0  300.0  400.0  500.0
Google      2.0  300.0  141.421356  200.0  250.0  300.0  350.0  400.0

In [13]:
df.groupby('Company').describe().transpose()

Company      Accenture    Deloitte      Google
Sales count        1.0    2.000000    2.000000
      mean       300.0  300.000000  300.000000
      std          NaN  282.842712  141.421356
      min        300.0  100.000000  200.000000
      25%        300.0  200.000000  250.000000
      50%        300.0  300.000000  300.000000
      75%        300.0  400.000000  350.000000
      max        300.0  500.000000  400.000000

In [27]:
df.groupby('Company').describe().loc['Deloitte']

Sales  count      2.000000
       mean     300.000000
       std      282.842712
       min      100.000000
       25%      200.000000
       50%      300.000000
       75%      400.000000
       max      500.000000
Name: Deloitte, dtype: float64

In [33]:
df.groupby('Company').describe().transpose()['Deloitte']

Sales  count      2.000000
       mean     300.000000
       std      282.842712
       min      100.000000
       25%      200.000000
       50%      300.000000
       75%      400.000000
       max      500.000000
Name: Deloitte, dtype: float64